### Import the kickstarter scraper

In [4]:
import getpass
from Kickstarter_scraper_to_MySQL import kickstarter_scraper
from sqlalchemy import create_engine

### Set the path to MySQL database

In [5]:
# === Input parameters ===
dbname = 'kickstarter_db2'  # Name of your database
user_id = getpass.getpass('user id:')  # User name
user_password = getpass.getpass('password:')  # Password

# Connection to the MySQL database
engine = create_engine("mysql+pymysql://%s:%s@localhost:3306/%s?charset=utf8"
                       % (user_id, user_password, dbname), encoding='utf8')

table_name_prefix = 'kickstarter' # The name / prefix of table that stores the data
separate_table_for_each_day = False # Whether to build a new table with date as its name, e.g. kickstarter_20170912
restart_drop_table = True # Drop existing table when running the code

# === Run the scraper ===
kickstarter_scraper(engine, table_name_prefix,
                    separate_table_for_each_day=separate_table_for_each_day,
                    restart_drop_table=restart_drop_table)

user id:········
password:········
Database exist? True
Theater
page number = 7, total number of items = 78
Photography
page number = 9, total number of items = 104
Dance
page number = 3, total number of items = 35
Comics
page number = 14, total number of items = 164
Journalism
page number = 6, total number of items = 72
Art
page number = 25, total number of items = 298
Music
page number = 33, total number of items = 395
Games
page number = 47, total number of items = 553
Crafts
page number = 11, total number of items = 132
Design
page number = 44, total number of items = 518
Fashion
page number = 32, total number of items = 381
Food
page number = 23, total number of items = 270
Technology
page number = 47, total number of items = 560
Film_and_Video
page number = 38, total number of items = 445
Publishing
page number = 38, total number of items = 451
number of rows in table "kickstarter" = 4456

          Category  Number of Projects
0              Art                 272
1           Comics                 150
2           Crafts                 116
3            Dance                  23
4           Design                 501
5          Fashion                 356
6   Film_and_Video                 421
7             Food                 255
8            Games                 535
9       Journalism                  59
10           Music                 373
11     Photography                  90
12      Publishing                 424
13      Technology                 521
14         Theater                  65

### Check how the database looks like

In [24]:
import pandas as pd
pd.options.display.max_columns = 100

table_name = table_name_prefix
con = engine.connect()

sql_query = """
SELECT project_name, project_country, project_goal, project_pledged 
FROM %s
LIMIT 5;
"""
kickstarter_data_from_sql = pd.read_sql_query(sql_query % (table_name),con)

kickstarter_data_from_sql

,project_name,project_country,project_goal,project_pledged
0,The Television Workshop: The New Home,GB,15000.0,14301.0
1,The New York Sorta Marathon,US,8000.0,3153.99
2,"\Joy\, a new play by Stephanie Martin",GB,5000.0,1270.0
3,Thanking You! Loving You!,US,5000.0,2285.0
4,The Noh Christmas Carol,US,10000.0,3526.0

### Sort projects into locations and order them by counts

In [21]:
sql_query = """
SELECT location_state, COUNT(project_name) FROM %s
GROUP BY location_state
ORDER BY COUNT(project_name) DESC
LIMIT 10;
"""
kickstarter_data_from_sql = pd.read_sql_query(sql_query % (table_name),con)

kickstarter_data_from_sql

  location_state  COUNT(project_name)
0             CA                  533
1        England                  428
2             NY                  261
3             TX                  178
4             FL                  148
5             ON                  112
6             IL                  107
7             WA                  102
8             GA                   80
9             OR                   72